In [2]:
import seaborn as sns
import pandas as pd
titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','sex','class','fare','survived']]
grouped = df.groupby(['class'])

In [7]:
labels = ['0~9','10~19','20~29','30~39','40~49','50~59','60~69','70~80']
bin_number = [0,9.9,19.9,29.9,39.9,49.9,59.9,69.9,80]
df['age_period'] = pd.cut(x=df['age'],bins=bin_number,labels=labels)
grouped_age_period = df.groupby(['age_period'])

In [9]:
apply_grouped_age_period = grouped_age_period.apply(lambda x: x.mean())
print(apply_grouped_age_period.head(50))

                  age       fare  survived
age_period
0~9          4.083387  30.576679  0.612903
10~19       16.779412  32.535132  0.401961
20~29       24.534091  27.278937  0.350000
30~39       33.910180  40.377294  0.437126
40~49       44.067416  38.002297  0.382022
50~59       53.447917  47.933333  0.416667
60~69       62.421053  48.367542  0.315789
70~80       72.357143  30.169057  0.142857

In [10]:
def z_score(x):
    return (x-x.mean()) / x.std()

In [12]:
age_zscore = grouped.age.apply(z_score)
print(age_zscore.head(10))

0   -0.251342
1   -0.015770
2    0.068776
3   -0.218434
4    0.789041
5         NaN
6    1.065103
7   -1.851931
8    0.148805
9   -1.134029
Name: age, dtype: float64

In [15]:
age_filter = grouped.apply(lambda x : x.age.mean() > 30)

In [16]:
print(age_filter)

class
First      True
Second    False
Third     False
dtype: bool

In [18]:
print(age_filter.index)
print(age_filter['First'])

CategoricalIndex(['First', 'Second', 'Third'], categories=['First', 'Second', 'Third'], ordered=False, name='class', dtype='category')
True

In [21]:
# Print First category
for x in age_filter.index:
    if age_filter[x] == True:
        df_age_filter = grouped.get_group(x)
        print(df_age_filter.head())

     age     sex     fare  survived
1   38.0  female  71.2833         1
3   35.0  female  53.1000         1
6   54.0    male  51.8625         0
11  58.0  female  26.5500         1
23  28.0    male  35.5000         1

In [22]:
grouped.head()

     age     sex   class     fare  survived age_period
0   22.0    male   Third   7.2500         0      20~29
1   38.0  female   First  71.2833         1      30~39
2   26.0  female   Third   7.9250         1      20~29
3   35.0  female   First  53.1000         1      30~39
4   35.0    male   Third   8.0500         0      30~39
5    NaN    male   Third   8.4583         0        NaN
6   54.0    male   First  51.8625         0      50~59
7    2.0    male   Third  21.0750         0        0~9
9   14.0  female  Second  30.0708         1      10~19
11  58.0  female   First  26.5500         1      50~59
15  55.0  female  Second  16.0000         1      50~59
17   NaN    male  Second  13.0000         1        NaN
20  35.0    male  Second  26.0000         0      30~39
21  34.0    male  Second  13.0000         1      30~39
23  28.0    male   First  35.5000         1      20~29

In [24]:
grouped = df.groupby(['class','sex'])
grouped_mean = grouped.mean()
grouped_mean.head(6)

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [25]:
print(grouped_mean.loc['First']) # 행 기준으로 출력

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

In [27]:
print(grouped_mean.loc['First','female']) # 행 기준으로 출력

age          34.611765
fare        106.125798
survived      0.968085
Name: (First, female), dtype: float64

In [35]:
print(grouped_mean.xs('male',level = 'sex',axis=0)) 
# 열 (level = 'sex) 기준으로 행 (axis = 0)을 출력

              age       fare  survived
class
First   41.281386  67.226127  0.368852
Second  30.740707  19.741782  0.157407
Third   26.507589  12.661633  0.135447